[
  {"date":"2024-01-18","workshop":"Building Modular Monoliths","opinion":"You won me over from the first slide. I envy your speed, experience, and how effectively you apply pragmatic thinking. It was a pure pleasure to watch you work.","original":"Kupiłeś mnie od pierwszego slajdu. Zazdroszczę Ci sprawności, doświadczenia i skutecznego aplikowania pragmatycznego myślenia. To była czysta przyjemność widzieć jak pracujesz."},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Thank you so much for an amazing training. It was great that there were lots of exercises - and honestly, it was one of the best-run trainings I've ever attended (and I've been to quite a few). Excellent knowledge, and what's important: your ability to pass it on is top-notch. I'm really happy I could take part in this course!!","original":"dziękuję bardzo za super szkolenie, super sprawa że było dużo ćwiczeń, przyznam szczerze, że jest było to jedno z najlepiej prowadzonych szkoleń w jakichkolwiek uczestniczyłem a przyznam że trochę ich miałem. Świetna wiedza i co ważne predyspozycje do jej przekazania są na najwyższym poziomie. Cieszę się bardzo że mogłem być uczestnikiem tego kursu!!."},
  {"date":"2021-10-13","workshop":"Effective Programming in Java","opinion":"I have a very positive impression. I expected a simple training, and instead I got a ton of knowledge along with good practices and guidance on what to avoid. With lots of hands-on work, it was much easier to organize and solidify what I learned.","original":"Mam bardzo pozytywne wrażenia. Spodziewałem się prostego szkolenia, a otrzymałem masę wiedzy wraz z dobrymi praktykami i wiedzą czego unikać. Przez dużą ilość praktyki znacznie łatwiej mi było uporządkować zdobytą wiedzę."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"It was substantial and dynamic. Great idea with writing code and pushing it to the repo during the training so everyone could work on the same codebase.","original":"Było treściwe, dynamiczne. Super opcja z pisaniem kodu i wrzucaniem go na repo w trakcie szkolenia, żeby wszyscy mogli pracować na tym samym kodzie."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Huge thanks! It was a short training, but it felt really well thought out and very content-rich. You clearly know what you're talking about - and you have not only theoretical knowledge.","original":"Wielkie dzięki! To było szybkie szkolenie, ale mam wrażenie, że dobrze przemyślane i bardzo treściwe. Widać, że wiesz o czym mówisz i że masz nie tylko teoretyczną wiedzę."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"A lot of theoretical and practical knowledge, great communication (clear expression, very good Polish), and energy - the training was delivered dynamically (which is super important in online trainings!).","original":"Duża wiedza teoretyczna i praktyczna, komunikatywność (czytelne przekazywanie myśli, ładny język polski), energia - szkolenie było prowadzone dynamicznie (a to turboważne w szkoleniach online!)."},
  {"date":"2024-01-19","workshop":"Modern Application Architectures (with Spring Boot)","opinion":"You can see experience built on years of hands-on work. You can also see the ease with which you can pass that experience on to others.","original":"Widać doświadczenie oparte na latach praktycznej pracy. Widać również swobodę by przekazać to doświadczenie innych"},
  {"date":"2021-06-23","workshop":"Effective Spring Boot","opinion":"Great knowledge; you answered questions, helped when there were problems, and suggested what could be done better.","original":"Duża wiedza, odpowiadał na pytania, pomagał w przypadku problemów, sugerował co można zrobić lepiej"},
  {"date":"2021-05-11","workshop":"Modern Application Architectures (with Spring Boot)","opinion":"A very good training - lots of knowledge and practical content, and a cool idea of continuously evolving the application while covering successive topics.","original":"Szkolenie bardzo dobre, dużo wiedzy, treści praktycznej, fajny pomysł stałego rozwijnia aplikacji uwzględniającego poszczególne tematy"},
  {"date":"2021-05-11","workshop":"Modern Application Architectures (with Spring Boot)","opinion":"Congrats on your knowledge, experience, and skills. Grzegorz is one of those people who actively creates knowledge (I've read his blog / Stack Overflow).","original":"Gratuluję wiedzy, doświadczenia oraz umiejętności. Grzegorz jest jedną z tych osób, która tworzy wiedzę (przeglądałem jego blog czy stack overflow)"},
  {"date":"2021-05-11","workshop":"Modern Application Architectures (with Spring Boot)","opinion":"I'm very impressed by Grzesiek's knowledge and his ability to run a training. He had no problem building good communication with the group.","original":"Jestem pod wielkim wrażeniem wiedzy Grześką oraz jego umiejętności prowadzenia szkolenia. Nie miał problemów z nawiązaniem komunikacji"},
  {"date":"2022-01-13","workshop":"Modern Java","opinion":"He could come up with examples off the top of your head on the spot, and even explain theory that wasn't on the slides by writing code live. You could tell the guy knew what he was doing and really knew his stuff.","original":"Potrafił z głowy na szybko podać przykłady, teorię też jeżeli nie była na slajdach pokazywał na bieżąco pisanym kodzie. Widać było, że ziomek wie co robi i zna się na rzeczy."},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"I rate the training very highly. I really liked the workflow because there was a lot of independent work. It was also very valuable that by going through the next stages of the program, we experienced the problems ourselves - which made it easier to understand WHY we chose a given solution later.","original":"Szkolenie oceniam bardzo dobrze. Schemat pracy bardzo przypadł mi do gustu, ponieważ było dużo pracy samodzielnej. Bardzo cenne było również to, że przechodząc przez kolejne etapy programu, na własnej skórze doświadczaliśmy omawianych problemów - łatwiej było potem zrozumieć DLACZEGO zastosowaliśmy dane rozwiązanie."},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Lots of useful information; using a project with examples and exercises instead of a typical slide deck is a great approach for programming trainings - same for the self-paced exercises with prepared tests.","original":"dużo przydatnych informacji; projekt z przykładami i ćwiczeniami zamiast zwyczajowej prezentacji to bardzo dobre rozwiązanie przy szkoleniach z programowania, tak samo forma ćwiczeń do samodzielnego wykonania z przygotowanymi testami"},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"I got a lot out of this training - one of the best lectures I've had the pleasure to attend.","original":"Bardzo dużo wyniosłem z tego szkolenia, jeden z fajniej poprowadzonych wykładów jakich miałem przyjemność posłuchać."},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"One of the best trainings I've participated in. Well-chosen and interesting topics. A good balance between breaks and active training. Perfect pace. Lots of interesting tidbits.","original":"Jedno z najlepszych w jakich brałem udział. Dobrze dobrane i ciekawe tematy. Odpowiedni stosunek przerw do aktywnego szkolenia. Idealne tempo. Sporo ciekawostek."},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"A closer look at Optionals, Streams, and Collectors. I also really liked the live performance comparisons of different solutions.","original":"Bliższe przyjrzenie się Optional'om i Stream'om i Collector'om. Bardzo podobały mi się też prezentowane na żywo porównania wydajnościowe różnych rozwiązań."},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"Great explanation skills, calm delivery, a healthy pace, and a good alternation between exercises and lectures.","original":"Świetne umiejętności tłumaczenia, spokój, zdrowe tempo, przeplatanie ćwiczeń i wykładów"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Thanks for presenting the topic of threads in a visual and understandable way. It finally let me understand the basics - and even sparked my interest :)","original":"Dzięki że przedstawiłeś w sposob obrazowy i zrozumiały temat wątków. Pozwolił mi to w końcu zrozumieć ich podstawy a nawet wzbudziło moje zainteresowanie :)"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"I'm very satisfied with the training. My programming knowledge level jumped up a notch.","original":"Jestem bardzo zadowolony z odbytego szkolenia. Mój poziom wiedzy w zakresie programowania wskoczył na poziom wyżej"},
  {"date":"2021-01-20","workshop":"","opinion":"Interesting delivery, ability to keep attention, broad knowledge, and the ability to teach in an engaging way - plus extra exercises for people who finished the basic tasks.","original":"Ciekawe prowadzenie szkolenia, umiejętność utrzymywania uwagi, szeroka wiedza, umiejętność przekazywania wiedzy w ciekawy sposób, dodatkowe ćwiczenia dla osób, które skończyły podstawowe zadania"},
  {"date":"2021-01-20","workshop":"","opinion":"Explaining with examples and diagrams. Lots of experience and knowledge from working in different projects. Strong communication skills and an engaging teaching style.","original":"Tłumaczenie na przykładach i diagramach. Spore doświadczenie i wiedza w pracy w różnych projektach. Umiejętności komunikacyjne i sposób przekazywania wiedzy w ciekawy sposób."},
  {"date":"2022-02-11","workshop":"Effective Spring Boot","opinion":"An interesting topic and delivered in an engaging way (mix of theory and practice, examples on a real repo project), with very good time management.","original":"Interesująca tematyka i ciekawie prowadzone (podział na teorie i praktykę, przykłady na żywym projekcie na repo), bardzo dobre zarządzanie czasem"},
  {"date":"2024-09-10","workshop":"Effective Programming in Java","opinion":"The pace of the training; frequent breaks; discussions with the team, but without forcing participants to answer. Creating a safe space :)","original":"Tempo prowadzenia szkolenia; częste przerwy; dyskusje z zespołem, ale bez wymuszania odpowiedzi od uczestników. Tworzenie safe space :)"},
  {"date":"2021-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"You could feel the professionalism. He was happy to help - I didn't use it personally, but from what I heard there were queues to the second room :).","original":"Czuć profesjonalizm, wiadomo. Chętny do pomocy, co prawda nie korzystałem, ale z tego co słyszałem to kolejki były do drugiego pokoju :)."},
  {"date":"2024-12-17","workshop":"","opinion":"Knowledge, the way it was delivered, and lots of examples.","original":"Wiedza, sposób jej przekazania, dużo przykładów"},
  {"date":"2022-08-26","workshop":"","opinion":"A lot of knowledge delivered with equal ease. Very friendly attitude toward participants and a huge willingness to help.","original":"Duża wiedza, którą z podobnie dużą łatwością przekazywał. Bardzo przyjazne nastawienie do uczestników i ogromna chęć pomocy."},
  {"date":"2022-11-25","workshop":"","opinion":"Composed delivery, no stuttering, no dragging things out - a radio voice.","original":"opanowanie, brak jąkania, przeciągania, radiowy głos"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"The trainer explained everything clearly, answered all questions, and it was obvious he had deep knowledge and experience in the training topic.","original":"Trener wyjaśniał wszystkie zagadnienia jasno, odpowiadał na wszystkie pytania, widać było że ma bardzo dużą wiedzę i doświadczenie w temacie szkolenia."},
  {"date":"2021-01-20","workshop":"","opinion":"Very strong subject-matter preparation and the ability to explain clearly and simply.","original":"Bardzo dobre przygotowanie merytoryczne prowadzącego, umiejętność przekazywania wiedzy w sposób klarowny i prosty."},
  {"date":"2022-01-13","workshop":"Modern Java","opinion":"A very good training - and even a beginner like me was able to complete most tasks independently, which shows the trainer explained the theory well.","original":"Bardzo dobre szkolenie i nawet taki laik jak ja był w stanie zrobić samodzielnie większość zadań, co swiadczy o tym że trener dobrze tłumaczył teorię."},
  {"date":"2024-01-17","workshop":"Modern Architecture","opinion":"A pragmatic approach, with many references to real/hypothetical situations and cases.","original":"Pragmatyczne podejście, wiele odniesień do realnych/hipotetycznych sytuacji czy przypadków"},
  {"date":"2022-11-25","workshop":"","opinion":"Very good command of the material, lots of practical tips, and real-life examples.","original":"dobra znajomość materiału, dużo praktycznych wskazówek, przykłady z życia"},
  {"date":"2023-12-11","workshop":"Effective Spring Boot","opinion":"A very valuable training, presented in an accessible way. I managed to better understand the hexagonal approach to systems architecture and pay attention to the pitfalls of 'Spring magic'. Thanks :)","original":"Bardzo wartościowe szkolenie, przedstawione w przystępny sposób. Udało mi się lepiej zrozumieć heksagonalne podejście do architektury systemów i zwracać uwagę na pułapki \"Springowej magii\". Dzięki :)"},
  {"date":"2023-12-11","workshop":"Modern Application Architectures (with Spring Boot)","opinion":"The training contains valuable content for anyone who has dealt with designing applications and systems based on Spring Boot and beyond. It included useful tips and helpful patterns. It was great to experiment on my own with problems that we later solved together.","original":"Szkolenie zawiera wartościowe treści dla każdego, kto miał styczność z projektowaniem aplikacji i systemów opartych na SpringBoot i nie tylko. Zawierało użyteczne wskazówki i przydatne wzorce. Fajnie było samemu poeksperymentować z problemami jakie później rozwiązywaliśmy wspólnie."},
  {"date":"2021-01-20","workshop":"","opinion":"Valuable both for less experienced developers and seniors, as a way to refresh and organize knowledge.","original":"Cenne zarówno dla mniej doświadczonych programistów, jak i seniorów, w ramach odświeżania/porządkowania wiedzy."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Excellent command of the topic and programming logic in general; he answered patiently and willingly to tons of questions - both about the subject and related technical topics.","original":"bardzo dobra znajomość tematu, ale i ogólnie logiki programowania, odpowiadał chętnie i cierpliwie na mnóstwo pytań dotyczących zarówno tematu jak i około technicznych rzeczy."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Coding speed and an ability to pass on knowledge through clear explanations with examples - very matter-of-fact.","original":"Sprawność kodowania, łatwość przekazywania wiedzy poprzez jasne tłumaczenie z przykładami, rzeczowość."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Thank you for your patience in answering questions and for igniting joy in programming - which will now be killed by the 'prose of life'.","original":"Dziękuje bardzo za cierpliwość w odpowiedziach na pytania i za rozpalenie radości z programowania, która to będzie teraz zabijana w \"prozie życia\""},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"A huge amount of knowledge and willingness to share it. Lots of valuable tips - including side tips (e.g., pro tips for working in IntelliJ IDEA).","original":"Ogromna wiedza i chęć dzielenia się nią. Dużo cennych wskazówek + tych pobocznych (np. protipy do pracy w IntelliJ IDEA)."},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"People like Grzesiek - passionate about their work - are a motivation for me.","original":"Tacy ludzie jak Grzesiek - z pasją do swojej pracy - są dla mnie motywacją."},
  {"date":"2024-03-18","workshop":"","opinion":"Awesome training! I wouldn't change anything - I got exactly what I wanted!","original":"Mega szkolenie! Kompletnie nic bym nie zmienil i dostałem to co chciałem!"},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"The best training I've been to.","original":"Najlepsze szkolenie na jakim byłem"},
  {"date":"2022-02-11","workshop":"Effective Spring Boot","opinion":"Probably the best training I've been to.","original":"Chyba najlepsze szkolenie na jakim byłem."},
  {"date":"2024-01-18","workshop":"Building Modular Monoliths","opinion":"This was definitely one of the best trainings.","original":"To jzdecydowanie jedno z najlepszych szkoleń."},
  {"date":"2024-03-18","workshop":"","opinion":"Noticing how Java has evolved, looking under the hood of asynchrony, functional Java.","original":"Zwrócenie na to jak ewoluowała Java, zajrzenie pod pokrywe asynchroniczności, Java funkcyjna"},
  {"date":"2021-01-20","workshop":"","opinion":"Learning less standard use cases of streams. Performance tidbits (streams are lazy), comparing Java 8 and 11. Showing practical use of CompletableFuture and thread pools.","original":"Poznanie mniej standardowych przypadków użycia steam. Ciekawostki dot. wydajności (streamy są lazy), porównanie javy 8 i 11. Pokazanie praktycznego zastosowania CompletableFuture + pule wątków."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Presenting approaches to splitting a monolith into modules and a possible future split into microservices.","original":"Przedstawienie rozwiązań na dzielenie monolitu na moduły i ewentualny przyszły podział na mikroservisy."},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Practical use cases; Project Loom.","original":"Praktyczne przypadki użycia, project LOOM"},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Topics around practical reactive programming, WebClient, and a comparison to the benefits of the new Java 21.","original":"Tematy związane z praktycznym zastosowaniem reaktywnego programowania, WebClient oraz porównanie do korzyści z nowej Javy 21."},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"Hexagonal architecture, CAP, Event Sourcing, CDC, Spring Actuator, messaging systems (asynchronous communication).","original":"Architektura heksagonalna, CAP, Event Sourcing, CDC, Spring Actuator, systemy kolejkowe (asynchroniczna komunikacja)"},
  {"date":"2024-01-18","workshop":"Building Modular Monoliths","opinion":"Hexagonal architecture, decomposition without extraction in a monolith.","original":"Hexagonal arch, dekompozycja bez ekstrakcji w monolicie."},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"A practical approach to using the reactive stack in web applications.","original":"Praktyczne podejście do użycia stosu reaktywnego w aplikacjach webowych."},
  {"date":"2021-06-23","workshop":"Effective Spring Boot","opinion":"Building a Spring application. Creating it from scratch, discussing all elements (classes, interfaces, etc.). Tests. Config files. Connecting to a database.","original":"Budowanie aplikacji w springu. Tworzenie jej od podstaw, omówienie wszystkich elementów (klas, interfejsów itd.) Testy. Pliki konfiguracyjne. Podłączenie do bazy danych."},
  {"date":"2021-05-11","workshop":"Effective Spring Boot","opinion":"Spring annotations - how they work and how to use them. System architecture.","original":"Adnotacje w Springu - jak działają i jak ich używać. Architektura systemu"},
  {"date":"2021-06-24","workshop":"Effective Spring Boot","opinion":"A bit of everything, but probably most of all: how to build one controller that contains most Spring annotations.","original":"wszystko po trochu, ale najbardziej chyba sposób na zbudowanie 1 kontrolera, w  którym będzie większość adnotacji springowych"},
  {"date":"2024-01-17","workshop":"Pragmatic Microservices","opinion":"An interesting, growth-oriented topic. Nice insights about the implementation and release process.","original":"ciekawa tematyka, rozwojowa. fajne przekminki na temat procesu implementacji i release'u"},
  {"date":"2024-01-17","workshop":"Pragmatic Microservices","opinion":"Creating and handling snapshots of a database/table and caching aggregates.","original":"tworzenie i obsluga snapshotow bazy/tabeli oraz cachowanie agregatow"},
  {"date":"2022-01-13","workshop":"Modern Java","opinion":"Huge knowledge and the ability to pass it on.","original":"Ogromna wiedza i umiejętność jej przekazywania"},
  {"date":"2024-09-06","workshop":"","opinion":"Precision, clarity, conciseness, and broad knowledge.","original":"precyzyjność, jasność, zwięzłość wypowiedzi, szeroka wiedza"},
  {"date":"2024-04-30","workshop":"","opinion":"Competence and all-around programming knowledge.","original":"kompetencja i wszechstronna wiedza o programowaniu"},
  {"date":"2024-03-21","workshop":"","opinion":"Experience in programming and teaching.","original":"doświadczenie w programowaniu i nauczaniu"},
  {"date":"2021-01-20","workshop":"","opinion":"Ease of communicating content; communicativeness.","original":"łatwość przekazywania treści, komunikatywność"},
  {"date":"2022-10-12","workshop":"Pragmatic Microservices","opinion":"Ability to pass on knowledge; visible interest in the topic.","original":"Umiejetność przekazywania wiedzy, widoczne zainteresowanie tematem"},
  {"date":"2021-05-11","workshop":"","opinion":"Communication, training format, and the way knowledge was delivered.","original":"Komunikatywność, forma szkolenia, sposób przekazywania wiedzy"},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Openness and good communication.","original":"Otwartość, komunikatywność"},
  {"date":"2023-12-11","workshop":"","opinion":"Clear delivery, open to questions and discussion.","original":"Klarowny przekaz wiedzy, otwarty na pytania / dyskusje"},
  {"date":"2022-11-28","workshop":"","opinion":"Openness, personal culture, high substantive level, and adjusting to the group's level.","original":"Otwartość, wysoka kultura osobista, wysoki poziom merytoryczny, dostosowywanie się do poziomu grupy"},
  {"date":"2024-09-06","workshop":"","opinion":"A very good trainer - broad knowledge and easy to work with.","original":"b. dobry trener, szeroka wiedza, kontaktowy"},
  {"date":"2024-09-06","workshop":"","opinion":"Huge knowledge and engagement.","original":"ogromna wiedza i zaangażowanie"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Accuracy in explanations, rich experience, and an ability to choose interesting examples.","original":"Dokładność w tłumaczeniu, bogate doświadczenie , umiejętność doboru ciekawych przykładów"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Rich subject knowledge and a good ability to explain.","original":"Bogata wiedza tematu, dobra umiejętność wyjaśnienia"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"You can see he has quite a lot of experience. He moved confidently through examples and dependent libraries.","original":"Widać, że ma dość dużo doświadczenie. Swobodnie poruszał się po przykładach i zależnych bibliotekach."},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Very deep knowledge and engagement.","original":"bardzo duża wiedza, zaangażowanie"},
  {"date":"2024-09-06","workshop":"","opinion":"Passion and the ability to spark interest in the topic.","original":"Pasja, umiejętność zainteresowania tematem"},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"A willingness to share knowledge.","original":"chęć przekazania wiedzy"},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"Knowledge, calmness, composure, a good atmosphere, and the ability to run a class well.","original":"wiedza, spokój, opanowanie, dobra atmosfera, umiejętność prowadzenia zajęć"},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"Competence, fluency of speech, excellent pace, and interesting 'asides'.","original":"Kompetencje, płynność wypowiedzi, doskonałe tempo prowadzenia szkolenia, ciekawe \"wstawki\"."},
  {"date":"2022-11-25","workshop":"","opinion":"Experience, smooth delivery, and a good voice.","original":"doświadczenie, płynność w prowadzeniu zajęć, dobry głos"},
  {"date":"2021-05-11","workshop":"","opinion":"Friendly and extremely knowledgeable - clearly someone who knows their stuff. He can also run trainings well: he knows when to take breaks, provides a separate room for consultations, and has very good organization.","original":"Sympatyczny i z ogromną wiedzą, widać, że jest to ktoś, kto zna się na rzeczy. Potrafi też prowadzić szkolenia, wie kiedy robić przerwy, wydziela osobny pokój do konsultacji, bardzo dobra organizacja"},
  {"date":"2021-05-07","workshop":"","opinion":"A private room - that's a very good idea.","original":"prywatny pokoj - to bardzo dobra idea"},
  {"date":"2021-06-23","workshop":"","opinion":"Direct, concrete, eager to help.","original":"Bezpośredni, konkretny, chętny do pomocy"},
  {"date":"2021-06-23","workshop":"","opinion":"Great training - thanks for sharing knowledge so concretely.","original":"Super szkolenie, dzięki za konkretne podzielenie się wiedzą."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"Good communication and flexibility with timing :)","original":"Dobra komunikacja, elastyczność do ram czasowych :)"},
  {"date":"2024-01-18","workshop":"Building Modular Monoliths","opinion":"Thanks to Grzegorz's flexibility, we managed the training time well. Everything worked out.","original":"Dzieki elastyczności Grzegorza mogliśmy dobrze zarządzić czasem na szkoleniu. Wszystko wyszło ok."},
  {"date":"2024-04-29","workshop":"","opinion":"The trainer answered most questions ad hoc, which is convincing.","original":"Trener ad-hoc odpowiadał na większość pytań, co jest przekonujące."},
  {"date":"2024-12-17","workshop":"","opinion":"He tried to help everyone regardless of their level.","original":"staral sie pomoc kazdemu niezaleznie od poziomu"},
  {"date":"2022-11-28","workshop":"","opinion":"Ability to keep attention and convey information.","original":"Umiejętność utrzymania uwagi i przekazania informacji"},
  {"date":"2022-11-25","workshop":"","opinion":"The training was solidly prepared with an appropriate amount of hands-on exercises.","original":"Szkolenie solidnie przygotowane z odpowiednią ilością ćwiczeń praktycznych."},
  {"date":"2021-01-20","workshop":"","opinion":"Very well-prepared exercises - small, concise, clearly defined.","original":"Bardzo fajnie przygotowane ćwiczenia. Małe, zwięzłe, jasno zdefiniowane."},
  {"date":"2021-06-23","workshop":"","opinion":"In general everything was useful. I started from zero and each topic sensibly developed my knowledge.","original":"W sumie wszystko było użyteczne. Zaczynałem od zera i każdy temat sensownie rozwijał wiedzę w temacie"},
  {"date":"2022-01-12","workshop":"","opinion":"Really nice - the level was adjusted to the average person in the group.","original":"bardzo fajne, poziom dostosowany do sredniej osoby w grupie"},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"A lot of hands-on work, which is definitely a plus.","original":"Dużo części praktycznej, co jest zdecydowanie na plus"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"I really liked that there were lots of practical tasks.","original":"bardzo podobało mi się, że było dużo zadań praktycznych."},
  {"date":"2023-06-26","workshop":"","opinion":"The training matched my level - it helps you grow but doesn't overwhelm after day one.","original":"Szkolenie odpowiednie na mój poziom wiedzy, pozwala się rozwinąć ale nie przytłacza wiedzą po pierwszym dniu"},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"Professionally delivered training, without boring the audience. The right amount of exercises.","original":"Szkolenie prowadzone profesjonalnie, bez zanudzania. Odpowiednia ilość ćwiczeń."},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"The training was well composed; no comments about the agenda.","original":"Szkolenie było dobrze skomponowane, brak uwag co do agendy."},
  {"date":"2024-09-06","workshop":"","opinion":"Charisma, good problem descriptions, openness to questions, and diving deep into topics (even side topics related to the main one).","original":"charyzma, dobre opisywanie problemów, otwartość na pytania, zagłębianie się w tematy (nawet pobocznych - związanych z głównym tematem)"},
  {"date":"2024-09-06","workshop":"","opinion":"A very well-run training - I'll remember it positively :)","original":"Bardzo dobrze przeprowadzone szkolenie, będę pozytywnie wspominał :)"},
  {"date":"2024-09-06","workshop":"","opinion":"Well-chosen, interesting, and development-oriented.","original":"Dobrze dobrana, interesująca oraz rozwijająca"},
  {"date":"2024-09-06","workshop":"","opinion":"Very positive impressions after the course.","original":"bardzo pozytywne wrażenia po kursie"},
  {"date":"2023-08-07","workshop":"Effective Microservices with Spring Boot","opinion":"You could see he had a lot of knowledge across many topics; the training was engaging, with lots of practice, and he approached people individually when needed.","original":"Było widać że ma dużą wiedzę na wiele tematów, prowadził szkolenie w ciekawy sposób, dużo praktyki, podchodził indywidualnie do osób które tego potrzebowały"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Very intensive - lots of interesting information.","original":"bardzo intensywne, dużo ciekawych informacji"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Very useful - it helps you get comfortable with advanced but powerful concepts in Java programming.","original":"Bardzo pożyteczne, dające możliwość oswoić się z zaawansowanymi ale też potężnymi konceptami programowania w Javie"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Great material - I'll definitely use it in everyday programming.","original":"świetny materiał, na pewno wykorzystam wiedzę w codziennym programowaniu."},
  {"date":"2022-10-12","workshop":"Pragmatic Microservices","opinion":"Great training - I learned a lot and can apply it at work.","original":"Świetne szkolenie, bardzo dużo się nauczyłem i mogę wdrożyć je do pracy"},
  {"date":"2021-01-20","workshop":"","opinion":"The most practical parts - basically everything we did exercises on.","original":"Te najbardziej praktyczne - właściwie wszystko z czego robiliśmy ćwiczenia."},
  {"date":"2024-10-29","workshop":"Building Modular Monoliths","opinion":"The whole training was equally useful - there was nothing more or less useful.","original":"całe szkolenie było równie użyteczne - nie było niczego mniej lub bardziej użytecznego"},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"Each next part was explained clearly, building on the previous one.","original":"Każda kolejna część jasno wyłożona, kolejne budujące na poprzednich."},
  {"date":"2024-05-10","workshop":"Effective Programming in Java","opinion":"Embarrassing to admit, but Part One opened my eyes the most to things I already use.","original":"Wstyd przyznać, ale Część pierwsza otworzyła mi najbardziej oczy na rzeczy, których już używam."},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"The training was very interesting. I learned many useful mechanisms and reinforced my knowledge of them.","original":"Szkolenie było bardzo ciekawe. Dowiedziałam się o wielu użytecznych mechanizmach i utrwaliłam wiedzę o nich."},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"All of them - some helped me organize what I already knew and dive into implementation details; others introduced topics I had no idea about before, and now I know what to work on next.","original":"wszystkie, niektóre pozwoliły mi usystematyzować posiadaną wiedzę i wgłębić się w szczegóły implementacyjne inne pozwoliły mi poznać nowe zagadnienia o których wcześniej nie miałem pojęcia a teraz wiem nad czym dalej pracować"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Each topic was covered in sufficient depth.","original":"każdy temat był wystarczająco obszernie omówiony"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"The materials and tasks were concrete and helped organize knowledge.","original":"Materiały i zadania były konkretne i pozwalające usystematyzować wiedzę."},
  {"date":"2023-06-26","workshop":"","opinion":"The trainer had a lot of knowledge and could explain it understandably; he also had many prepared tasks and interesting tidbits related to the training topic.","original":"Trener miał dużą wiedzę i potrafił ją przekazać w zrozumiały sposób, miał także przygotowane wiele zadań i ciekawostek związanych z tematem szkolenia.."},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"Ability to explain difficult concepts and share insights gathered over many years of experience.","original":"umiejetnosc tłumaczenia trudnych konceptów, dzielenie sie spostrzeżeniami zebranymi podczas swojego długoletniego stażu"},
  {"date":"2021-05-11","workshop":"","opinion":"A very well-run training - many unclear aspects were explained.","original":"Bardzo dobrze poprowadzone szkolenie, wiele niejasnych aspektów zostało wyjasnionych"},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"He tells stories in an interesting way, knows the topic, and actively participates in exercises.","original":"Ciekawie opowiada, zna się na temacie, aktywnie uczestniczy w ćwiczeniach"},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"I listened with interest until the last minutes :)","original":"Słuchałem z zaciekawieniem do ostatnich minut :)"},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"A very good training - one of the better ones I've attended.","original":"Bardzo dobre szkolenie. Jedno z lepszych, w których uczestniczyłem."},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"The trainer was very communicative. He explained topics efficiently and in depth.","original":"Trener był bardzo komunikatywny. Sprawnie i dogłębnie tłumaczył poruszane tematy."},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"Presenting the basics of Spring in a simple and understandable way.","original":"Przedstawienie podstawowych zagadnień Spring w sposób prosty i zrozumiały."},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Patience, confidence, constant monitoring of the group's level, and adjusting pace and difficulty of the presented material.","original":"Cierpliwość, pewność siebie, stałe monitorowanie poziomu grupy i dostosowanie tempa i trudności wykładanego materiału."},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Thanks for the willingness to share knowledge beyond the agreed training program.","original":"Podziękowania za chęć dzielenia się wiedzą wykraczającą ponad ustalony program nauczania."},
  {"date":"2022-11-25","workshop":"","opinion":"An extra set of homework tasks for long winter evenings.","original":"dodatkowe zbiór zadań do domu na długie zimowe wieczory"},
  {"date":"2023-06-23","workshop":"Effective Spring Boot","opinion":"He should have a second job in radio.","original":"Powinien miec kolejny etat w radiu"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Knowledge, interest in the topic - you can see passion in what he does.","original":"widza, zainteresowanie temat, widać pasję w tym co robi"},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Thanks for the honesty about Reactor :)","original":"Dzięki za szczerość na temat reactora :)"},
  {"date":"2023-12-13","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"Good training, no flattery.","original":"Dobre szkolenie, bez wazeliny"},
  {"date":"2021-05-11","workshop":"Effective Spring Boot","opinion":"Bean configuration, how annotations work, and different ways to solve the same problem.","original":"Konfiguracja beanów, jak działają adnotacje, różne możliwości rozwiązania tego samego problemu"},
  {"date":"2022-02-11","workshop":"Modern Architectures with Spring Boot","opinion":"Basically all of it was useful - the 'fun fact' inserts were great (e.g., running surrounding tools, useful pro tips, Docker, jq).","original":"W zasadzie wszystkie będą użyteczne, fajne były wstawki \"ciekawostki\" (np uruchamianie okalających tooli, przydatne pro-tipy, docker, jq)"},
  {"date":"2022-10-12","workshop":"Pragmatic Microservices","opinion":"Substantive preparation, knowledge, and the way the training was conducted.","original":"Przygotowanie merytoryczne, wiedza, sposób przeprowadzenia szkolenia"},
  {"date":"2023-06-23","workshop":"Pragmatic Reactive Programming with Reactor and Webflux","opinion":"A good training for someone who doesn't grasp reactivity very well.","original":"Dobre szkolenie dla osoby która słabo ogarnia temat reaktywności"},
  {"date":"2022-08-26","workshop":"","opinion":"Thanks a lot for a great training. As a less experienced person, I learned many useful things!","original":"Dzięki bardzo za super szkolenie. Jako osoba mniej zaawansowana nauczyłem się wielu przydatnych rzeczy!"}
]
