[
  {
    "quote": "Grzegorz helped us level up senior PHP engineers who could write Java, but didn't yet think like idiomatic Java engineers.<br><br>He helped us focus on the hard parts of building Java-based distributed systems and gave us pragmatic guidance on which choices actually matter in production.",
    "author": "Mateusz Jackiewicz",
    "title": "Team Lead",
    "company": "Volt.io",
    "tags": ["masterclass"]
  },
  {
    "quote": "We reached out to Grzegorz because we needed help with a tricky Java 8 to Java 11 migration which surfaced transient, hard-to-reproduce production issues, including unexpected transaction deadlocks and other intermittent failures.<br><br>Grzegorz helped us push through the most painful problems, gave us pragmatic guidance we could apply immediately, and enabled a smooth, safe production rollout.",
    "author": "Wojciech Przybylski",
    "title": "Director of Software Development and Support",
    "company": "Smart4Aviation",
    "tags": ["consulting"]
  },
  {
    "quote": "Grzegorz tailored a custom strategy and executed it, which gave me a new perspective by uncovering details I overlooked, allowing me to make an informed decision. <br><br>I'll definitely reach out again if I need similar help again.",
    "author": "Peter Chabros",
    "title": "CEO",
    "company": "BespokeSoft",
    "tags": ["consulting"]
  },
  {
    "quote": "Grzegorz is one of those rare individuals who combines people leadership with excellent technical aptitude. At Hazelcast, he was the chief architect for the company's managed service. He led the transformation of a project with sizeable technical debt. <br><br>The result was that the team scaled to double the size and was deploying to production ten times as frequently as before with higher quality (...) always getting the buy-in from the team before introducing any systemic changes.",
    "author": "Can Gencer",
    "title": "Director of Engineering",
    "company": "Hazelcast",
    "tags": ["contract"]
  },
  {
    "quote": "I've been working with Grzegorz for a while now and continue to see some clear and consistent things. <br>The phrase \"going the extra mile\" is a bit overused today, but it certainly fits well here. <br><br> Grzegorz is consistently handling the extra details that most people skip over. That coupled with a open way of collaborating with me and with the team has made our work highly productive.",
    "author": "Eugen Paraschiv",
    "title": "CEO",
    "company": "Baeldung",
    "tags": ["contract"]
  },
  {
    "quote": "Grzegorz is a passionate software architect and engineer who can jump straight into the deep end, make an impact, and tackle tough problems. <br><br>At the same time, he's the type of engineer who brings a broad perspective (...) This perspective is rare and valuable as great ideas come from many sources. <br><br>He's also able to recruit great talent.",
    "author": "John DesJardins",
    "title": "CTO",
    "company": "Hazelcast",
    "tags": ["contract"]
  },
  {
    "quote": "Grzegorz is simply brilliant. He not only has amazing technical knowledge and skills, but he is also very capable at design and has a gift for explaining even very complicated concepts in a very simple manner. <br><br>In addition, he is friendly and easy-going, and other engineers tend to follow him naturally just because he goes for facts, not words.",
    "author": "Bruno Fratini",
    "title": "Senior Engineering Manager",
    "company": "Casumo",
    "tags": ["contract"]
  },
  {
    "quote": "Grzegorz Piwowarek led workshops at e-point S.A. for 12 programmers about functional programming in Java 8. <br><br> He was well prepared, used appropriate exercises and supported participants at their own laptops. All participants upvoted the workshop and wish another one.",
    "author": "Marek Berkan",
    "title": "Team Leader",
    "company": "e-point SA",
    "tags": ["workshop"]
  }
]

